app/controllers/admin/direct_messages_controller.rb

SELECT * FROM `direct_messages`
---
  def index
    @direct_messages = DirectMessage.all

INSERT INTO `direct_messages` (`name`, `created_at`, `updated_at`, `message`, `active`) VALUES('Default', '2010-01-11 21:19:41', '2010-01-11 21:19:41', 'Just wanted to let you know I did this to help with this cause', 1)
---
  def create
    @direct_message = DirectMessage.new(params[:direct_message])
    if @direct_message.save