app/controllers/admin/statuses_controller.rb

  def index
    @statuses = Status.all
---
SELECT * FROM `statuses`

  def create
    @status = Status.new(params[:status])
    if @status.save
---
INSERT INTO `statuses` (`name`, `created_at`, `updated_at`, `message`, `active`) VALUES('Default', '2010-01-11 20:55:37', '2010-01-11 20:55:37', 'I\'m voting on Facebook to help save this couple\'s child, <a href=\"http://voteforacure.com\" target=\"_blank\">VoteForACure.com</a>', 1)

  def destroy
    @status.destroy
---
DELETE FROM `statuses` WHERE `id` = 2