app/controllers/admin/stories_controller.rb

SELECT * FROM `stories`
---
  def index
    @stories = Story.all

INSERT INTO `stories` (`name`, `created_at`, `picture_content_type`, `updated_at`, `picture_updated_at`, `picture_file_name`, `picture_file_size`, `copy`, `active`) VALUES('Gwen Strong', '2010-01-11 21:16:51', 'image/jpeg', '2010-01-11 21:16:51', '2010-01-11 21:16:51', 'gwen.jpg', 4123, 'Our daughter Gwendolyn was born with SMA Type I. She can\'t breath, eat or swallow on her own, but her mind is healthy and she has a zest for life', 1)
---
  def create
    @story = Story.new(params[:story])
    if @story.save