app/controllers/admin/tweets_controller.rb

  def index
    @tweets = Tweet.all(:order => "created_at DESC")
---
SELECT * FROM `tweets` ORDER BY created_at DESC