app/controllers/tweets_controller.rb

SELECT * FROM `tweets`
---
  def index
    @tweets = Tweet.all

SELECT * FROM `users` WHERE (profile_image_url is not null and profile_image_url not like '%default_profile_normal.png%') ORDER BY created_at DESC
SELECT count(*) AS count_all FROM `users` WHERE (login IS NOT null)
SELECT SUM(followers_count) as reach FROM `users` LIMIT 1
---
  def new
    @tweet = Tweet.new()
    @profile_pics = User.find(:all, :conditions => "profile_image_url is not null and profile_image_url not like '%default_profile_normal.png%'", :order => "created_at DESC").collect {|x| x.profile_image_url}
    @tweet_reach = commify(User.find(:first, :select => "SUM(followers_count) as reach").reach)
    @tweet_count = commify(User.count(:conditions => 'login IS NOT null'))

INSERT INTO `tweets` (`created_at`, `completed`, `updated_at`, `number_of_friends`, `number_of_followers`, `is_following`, `profile_pic_url`, `twitter_id`, `sent_dm`, `status_id`) VALUES('2010-01-11 17:02:29', NULL, '2010-01-11 17:02:29', NULL, NULL, 1, NULL, NULL, 1, NULL)
---
  def create
    @tweet = Tweet.new(params[:tweet])
    if @tweet.save

SELECT * FROM `tweets` WHERE (`tweets`.user_id = 2) LIMIT 1
DELETE FROM `tweets` WHERE (`id` IN (9))
---
  def edit
    @tweet = Tweet.find_by_id(session[:tweet_id])
    if current_user.tweet then # => check to see if they have already tweeted
      @tweet.delete # => remove since duplicate